one_shot_ircot_demo_docs = (
    """维基百科标题：Milk and Honey (album)\n《牛奶与蜂蜜》是约翰·列侬和小野洋子1984年发行的专辑。继精选集《约翰·列侬合集》之后，这是列侬的第八张也是最后一张录音室专辑，也是他的新音乐首次在死后发行，录制于他生命的最后几个月，包括1980年专辑《双重幻想》的录制期间及之后。该专辑由小野洋子与格芬唱片公司合作整理。\n\n"""
    """维基百科标题：John Lennon Museum\n约翰·列侬博物馆（日语：ジョン・レノン・ミュージアム）位于日本埼玉县埼玉市中央区的埼玉超级竞技场内部。该博物馆旨在保存关于约翰·列侬的生平及音乐事业的资料。它展示了列侬的遗孀小野洋子收藏的他的纪念品以及其他展品。博物馆于2000年10月9日（列侬诞辰60周年）开馆，2010年9月30日因与小野洋子的展览合同到期而闭馆。博物馆参观从欢迎辞和小野洋子 narrated的短片开始（日语旁白，提供英语耳机），最后到达一个前卫风格的“反思室”，里面有许多椅子，面向播放动态文字和图像的幻灯片。这个房间之后是一个出售约翰·列侬纪念品的礼品店。\n\n"""
    """维基百科标题：Walls and Bridges\n《墙与桥》是英国音乐家约翰·列侬的第五张录音室专辑。由苹果唱片公司于1974年9月26日在美国发行，10月4日在英国发行。这张专辑是在他与小野洋子分离18个月期间创作、录制和发行的，捕捉了列侬处于“失落周末”时期的状态。《墙与桥》是美国公告牌排行榜冠军专辑，包含两首热门单曲《Whatever Gets You thru the Night》和《#9 Dream》。其中第一首是列侬作为独唱艺术家在美国的首支冠军单曲，也是他生前在美国或英国唯一的冠军单曲。\n\n"""
    """维基百科标题：Nobody Loves You (When You're Down and Out)\n《Nobody Loves You (When You're Down and Out)》是约翰·列侬创作的歌曲，收录于他1974年的专辑《墙与桥》中。这首歌还被收录在1986年的精选集《Menlove Ave.》、1990年的盒装专辑《Lennon》、1998年的盒装专辑《John Lennon Anthology》、2005年的双碟精选集《》以及2010年的盒装专辑《Gimme Some Truth》中。\n\n"""
    """维基百科标题：Give Peace a Chance\n《给和平一个机会》是一首反战歌曲，由约翰·列侬创作（署名列侬-麦卡特尼），与小野洋子在加拿大魁北克省蒙特利尔共同表演。1969年由塑料小野乐队在苹果唱片公司发行单曲（英国 catalog 为Apple 13，美国为Apple 1809），这是列侬发行的首支独唱单曲，当时他仍是披头士乐队成员，成为20世纪70年代美国反战运动的 anthem。它在《公告牌》百强单曲榜上排名第14位，在英国单曲榜上排名第2位。\n"""
)



one_shot_ircot_demo = (
    f'{one_shot_ircot_demo_docs}'
    '\n\n问题：'
    f"《Nobody Loves You》由约翰·列侬创作并发行在哪个由苹果唱片公司发行的专辑中？该专辑是在他与小野洋子分离18个月期间创作、录制和发行的？"
    '\n思考：'
    f"由苹果唱片公司发行，且在约翰·列侬与小野洋子分离18个月期间创作、录制和发行的专辑是《墙与桥》。《Nobody Loves You》由约翰·列侬创作并收录于《墙与桥》专辑中。因此答案是：《墙与桥》。"
    '\n\n'
)

ircot_system = (
    '你是一个智能助手，擅长帮助用户通过跨多个文档的复杂多跳推理解决问题。此任务通过示例说明，每个示例包含一组文档、一个相关问题及其多跳推理过程。你的任务是为当前步骤生成一个思考步骤，不要一次性生成完整推理！如果你认为已到最后一步，请以“因此答案是：”开头。'
    '\n\n'
    f'{one_shot_ircot_demo}'
)


prompt_template = [
    {"role": "system", "content": ircot_system},
    {"role": "user", "content": "${prompt_user}"}
]